detailedDepotCHT/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

// Define the vertices of the bounding box.
// Make sure these coordinates fully enclose your depot.stl and provide
// a buffer for the ambient region.
vertices
(
    (-51 -20 -5)
    (51 -20 -5)
    (51 20 -5)
    (-51 20 -5)
    (-51 -20 5)
    (51 -20 5)
    (51 20 5)
    (-51 20 5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (102 40 10) simpleGrading (1 1 1)
    //hex (0 1 2 3 4 5 6 7) (204 80 20) simpleGrading (1 1 1)
    //hex (0 1 2 3 4 5 6 7) (408 160 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    ambient
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (1 2 6 5)
            (0 1 5 4)
            (2 3 7 6)
            (4 5 6 7)
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //