detailedDepotCHT/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    DepotCelling
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
    DepotWall
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
    DepotFloor
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
    DepotPanel12
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
    DepotWindow
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
    DepotShutter
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }



}


// ************************************************************************* //
