detailedDepotCHT/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    DepotCelling
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    DepotWall
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    DepotFloor
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    DepotPanel12
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    DepotWindow
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    DepotShutter
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    

}


// ************************************************************************* //
